// задачи


#include <iostream>
using namespace std;

/*
1)2 строки без ошибок
 
2)int main() {
	cout << "грачева\n";
	cout << "рпо 25/4 \n";
	return 0;
}

3)int main() {
	cout << "compile\n";
	cout << "link\n";
	cout << "run\n";
	return 0;
}

4)int main() {
	cout << "год: " << 2026;
	return 0;
}

5)int main() {
	cout << 1<<" "<< 2<< " "<< 3;
	return 0;
}

6)ошибка на этой или следующей строке.

7)идентификатор не определён.

8)часто ошибка в конце файла.

9)int main() {
    cout << "грачева\n";
    cout << "арина\n";
    cout << "евгеньевна\n";
    return 0;
}

10)int main() {
	cout << "2 + 2 = " << 4;
	return 0;
}

11)//
комментарий не выводится на экран
и не повторяет фразу из программы дословно.

12)тот же текст


// самостоятельно

a)int main() {
	cout << "грачева\n";
	cout << "рпо 25/4 \n";
	cout << "C++";
	return 0;
}

b)int main() {
	cout << "C++";
	cout << "compile\n";
	cout << "link\n";
	cout << "run\n";
	return 0;
}

c)int main() {
	cout << "10\n";
	cout << "20\n";
	cout << "30\n";
	return 0;
}

d)int main() {
	cout << "сумма" << 10 << " готова";
		return 0;
}

e) убрала ; появилась ошибка. вернула ; — программа заработала
   убрала кавычку " появилась ошибка. вернула кавычку — программа заработала

f)int main() {
	cout << "лед\n";
	cout << "фигурное катание \n";
	return 0;
}

g)int main() {              // начало главной функции программы. main  главная функция, с неё начинается запуск программы
	cout << "грачева\n";    // cout - функция, cout << выводит на консоль мою фамилию, \n делает так чтобы было с новой строчки
	cout << "рпо 25/4 \n";  // cout << выводит номер группы
	cout << "C++";          // cout << выводит название языка на котором пишу
	return 0;               // программа проверяет на отсутствие ошибок
}                           // закрытие функции

h) все понятно
